Revit 2024 API
FabricSheet.GetSheetLocation Method
 Gets the position and the orientation of the Fabric Sheet instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Transform GetSheetLocation()
Visual Basic
Public Function GetSheetLocation As Transform
Visual C++
public:
Transform^ GetSheetLocation()
Return Value
 The location of the Fabric Sheet instance.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace